# Install XCode via Mac App Store first
# Run `brew tap homebrew/bundle` to brew `brew bundle`
# Run `brew bundle` to brew the list below

# Install Cask
tap 'caskroom/cask'

# Install drivers (for Sonos)
tap 'caskroom/drivers'

# Fonts
tap 'homebrew/cask-fonts'

## CLI Tools
brew "ack"
brew "ansible"
brew "bat"
brew "docker"
brew "dos2unix"
brew "emacs"
brew "fasd"
brew "fd"
brew "findutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "graphviz"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mas"
brew "md5sha1sum"
brew "nmap"
brew "node"
brew "openssl"
brew "p7zip"
brew "parallel"
brew "pv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "ruby-install"
brew "selecta"
brew "sloccount"
brew "sqlite"
brew "ssh-copy-id"
brew "httpie"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "giflossy"

cask "alfred"
cask "arq"
cask "atom"
cask "bartender"
cask "caffeine"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "geekbench"
cask "google-chrome"
cask "hazel"
cask "iterm2"
cask "muzzle"
cask "mysqlworkbench"
cask "ngrok"
cask "nvalt"
cask "omnifocus"
cask "postman"
cask "slack"
cask "sonos"
cask "spotify"
cask "sublime-text"
cask "superduper"
cask "tower"
cask "transmission"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "vmware-fusion"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Deliveries", id: 924726344
mas "Divvy", id: 413857545
mas "Fantastical 2", id: 975937182
mas "GrandPerspective", id: 1111570163
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "MindNode", id: 992076693
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Screenflow 7", id: 1223627207
mas "Shush", id: 496437906
mas "Skitch", id: 425955336
mas "Soulver", id: 413965349
mas "The Clock", id: 488764545
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Spark", id: 1176895641
