# Install XCode via Mac App Store first
# Run `brew tap homebrew/bundle` to brew `brew bundle`
# Run `brew bundle` to brew the list below

# Install Cask
tap 'caskroom/cask'

# Install drivers (for Sonos)
tap 'caskroom/drivers'

## CLI Tools
brew "ack"
brew "ansible"
brew "chromedriver"
brew "docker"
brew "emacs"
brew "fasd"
brew "findutils"
brew "ffmpeg"
brew "git"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "mas"
brew "md5sha1sum"
brew "nmap"
brew "node"
brew "openssl"
brew "p7zip"
brew "parallel"
brew "pv"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "ruby-install"
brew "selecta"
brew "sloccount"
brew "sqlite"
brew "ssh-copy-id"
brew "httpie"
#SSHPass <- Used for Ansible
brew "http://git.io/sshpass.rb"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "giflossy"

## Menubar Tools
cask "alfred"
cask "caffeine"
cask "dropbox"
cask "bartender"
cask "hazel"

## GUI Tools
cask "virtualbox"
cask "vagrant"
cask "vmware-fusion"

cask "google-chrome"
cask "firefox"

cask "iterm2"
cask "nvalt"
cask "slack"
cask "screenhero"
cask "sonos"
cask "sublime-text"
cask "spotify"
cask "omnifocus"
cask "transmit"
cask "dash"
cask "fluid"
cask "postman"
cask "ngrok"

cask "vlc"
cask "superduper"

# Mac App Store
mas "Tweetbot", id: 557168941
mas "1Password", id: 443987910
mas "Shush", id: 496437906
mas "Divvy", id: 413857545
mas "GrandPerspective", id: 1111570163
mas "Pixelmator", id: 407963104
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Fantastical 2", id: 975937182
mas "Airmail 3", id: 918858936
mas "Marked 2", id: 890031187
mas "Pages", id: 409201541
mas "Deliveries", id: 924726344
