# Install XCode via Mac App Store first
# Run `brew tap homebrew/bundle` to brew `brew bundle`
# Run `brew bundle` to brew the list below

## CLI Tools
brew "ack"
brew "bat"
brew "coreutils"
brew "docker"
brew "dos2unix"
brew "fasd"
brew "fd"
brew "findutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-absorb"
brew "go"
brew "graphviz"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mas"
brew "md5sha1sum"
brew "nmap"
brew "node"
brew "openssl"
brew "p7zip"
brew "parallel"
brew "pv"
brew "rbenv"
brew "redis"
brew "restic"
brew "ripgrep"
brew "ruby-build"
brew "ruby-install"
brew "sloccount"
brew "sqlite"
brew "ssh-copy-id"
brew "httpie"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "trash"
# Using Homebrew's because MacOS's doesn't have Python3 support and Ultisnips
# gets _very_ angry without it
brew "vim"

cask "1password-cli"
cask "aerial"
cask "alfred"
cask "anki"
cask "bartender"
cask "caffeine"
cask "dash"
cask "discord"
cask "docker"
cask "elgato-stream-deck"
cask "finicky"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "fork"
cask "geekbench"
cask "google-chrome"
cask "hazel"
cask "iterm2"
cask "muzzle"
cask "moom"
cask "ngrok"
cask "nvalt"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "postman"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "superduper"
cask "tableplus"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Fantastical", id: 975937182
mas "GrandPerspective", id: 1111570163
mas "Marked 2", id: 890031187
mas "MindNode", id: 992076693
mas "Pixelmator Pro", id: 1289583905
mas "Shush", id: 496437906
mas "Soulver", id: 413965349
mas "Spark", id: 1176895641
mas "CARROT Weather", id: 993487541
